espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG23/Include/efm32pg23b200f64im40.h
/* Common peripheral register block offsets. */
#define PER_REG_BLOCK_SET_OFFSET             0x1000UL    /**< Offset to SET register block */
#define PER_REG_BLOCK_CLR_OFFSET             0x2000UL    /**< Offset to CLEAR register block */
#define PER_REG_BLOCK_TGL_OFFSET             0x3000UL    /**< Offset to TOGGLE register block */
#define DMEM_BANK0_SIZE                      0x4000UL    /**> Bank0 size */
#define DMEM_BANK1_SIZE                      0x4000UL    /**> Bank1 size */
#define DMEM_BANK2_SIZE                      0x4000UL    /**> Bank2 size */
#define DMEM_BANK3_SIZE                      0x4000UL    /**> Bank3 size */
#define DMEM_BANK4_SIZE                      0x2000UL    /**> Bank4 size */
#define DMEM_BANK5_SIZE                      0x2000UL    /**> Bank5 size */
#define DMEM_BANK6_SIZE                      0x2000UL    /**> Bank6 size */
#define DMEM_BANK7_SIZE                      0x2000UL    /**> Bank7 size */
#define DMEM_NUM_BANKS                       0x4UL       /**> Number of physical SRAM banks */
#define DMEM_NUM_PORTS                       0x2UL       /**> Number of AHB slave ports */
#define DMEM_NUM_PORTS_IS_2                  0x1UL       /**> Boolean indicating if NUM_PORTS=2 */
#define HFRCO0_EM23ONDEMAND                  0x0UL       /**> EM23 On Demand */
#define HFRCO0_EXCLUDEEM23ONDEMAND           0x1UL       /**> Exclude EM23 On Demand */
#define LFXO_NO_CTUNE                        0x0UL       /**> CTUNE Not Present */
#define LFXO_CTUNE                           0x1UL       /**> CTUNE Present */
#define MSC_CDA_PRESENT                      0x0UL       /**>  */
#define MSC_FDIO_WIDTH                       0x40UL      /**> None */
#define MSC_FLASHADDRBITS                    0x14UL      /**> None */
#define MSC_FLASHBLOCKADDRBITS               0x14UL      /**> None */
#define MSC_FLASH_BLOCK_INFO_PCOUNT          0x2UL       /**> None */
#define MSC_FLASH_BLOCK_MAIN_PCOUNT          0x50UL      /**>  */
#define MSC_INFOADDRBITS                     0xEUL       /**> None */
#define MSC_INFOBLOCKADDRBITS                0xEUL       /**> None */
#define MSC_INFO_PSIZE_BITS                  0xDUL       /**> None */
#define MSC_MAIN_PSIZE_BITS                  0xDUL       /**> None */
#define MSC_REDUNDANCY                       0x2UL       /**> None */
#define MSC_ROOTMAIN_PRESENT                 0x1UL       /**>  */
#define MSC_UD_PRESENT                       0x1UL       /**>  */
#define MSC_YADDRBITS                        0x6UL       /**>  */
#define ICACHE0_AHB_LITE                     0x0UL       /**> AHB Lite */
#define ICACHE0_CACHEABLE_SIZE               0x80000UL   /**> Cache Size */
#define ICACHE0_CACHEABLE_START              0x8000000UL /**> Cache Start */
#define ICACHE0_DEFAULT_OFF                  0x0UL       /**> Default off */
#define ICACHE0_FLASH_SIZE                   0x80000UL   /**> Flash size */
#define ICACHE0_FLASH_START                  0x8000000UL /**> Flash start */
#define ICACHE0_LOOPCACHE_MEM_ADDR_BITS      0x3UL       /**> Loopcache Memory Address bits */
#define ICACHE0_LOOPCACHE_STICKINESS_BITS    0x4UL       /**> Loopcache Stickiness bits */
#define ICACHE0_PARITY_BITS                  0x1UL       /**> Use Parity */
#define ICACHE0_PC_BITS                      0x20UL      /**> Performance Counter bits */
#define ICACHE0_PIPE_STAGE                   0x1UL       /**> Pipeline Stage */
#define ICACHE0_RAM_ADDR_BITS                0x0UL       /**> RAM Address bits */
#define ICACHE0_RAM_DATA_BITS                0x0UL       /**> RAM Data bits */
#define ICACHE0_SET_BITS                     0x5UL       /**> Set bits */
#define ICACHE0_USE_HREADY_GATING            0x1UL       /**> Use HREADY gating */
#define ICACHE0_USE_IDLE_GATING              0x1UL       /**> Use IDLE gating */
#define ICACHE0_USE_LOOPCACHE                0x1UL       /**> Use Loopcache */
#define ICACHE0_WAY_BITS                     0x1UL       /**> Way bits */
#define ICACHE0_WORDS_PER_BLOCK              0x0UL       /**> Words Per Block */
#define ICACHE0_WPB_BITS                     0x1UL       /**> Words Per Block bits */
#define ICACHE0_WPL_BITS                     0x3UL       /**> Words Per Line bits */
#define PRS_ASYNC_CH_NUM                     0xCUL       /**> None */
#define PRS_PRSSEL_WIDTH                     0x4UL       /**> New Param */
#define PRS_SPRSSEL_WIDTH                    0x2UL       /**> New Param */
#define PRS_SYNC_CH_NUM                      0x4UL       /**> None */
#define GPIO_COMALLOC_WIDTH                  0x4UL       /**> New Param */
#define GPIO_MODE_WIDTH                      0x4UL       /**> Mode Width */
#define GPIO_NUM_EM4_WU                      0xCUL       /**> New Param */
#define GPIO_NUM_EVEN_PA                     0x6UL       /**> Num of even pins port A */
#define GPIO_NUM_EVEN_PB                     0x4UL       /**> Num of even pins port B */
#define GPIO_NUM_EVEN_PC                     0x5UL       /**> Num of even pins port C */
#define GPIO_NUM_EVEN_PD                     0x3UL       /**> Num of even pins port D */
#define GPIO_NUM_EXT_INT                     0xCUL       /**> New Param */
#define GPIO_NUM_EXT_INT_L                   0x8UL       /**> New Param */
#define GPIO_NUM_EXT_INT_U                   0x4UL       /**> New Param */
#define GPIO_NUM_EXT_INT_U_ZERO              0x0UL       /**> New Param */
#define GPIO_NUM_ODD_PA                      0x5UL       /**> Num of odd pins port A */
#define GPIO_NUM_ODD_PB                      0x3UL       /**> Num of odd pins port B */
#define GPIO_NUM_ODD_PC                      0x5UL       /**> Num of odd pins port C */
#define GPIO_NUM_ODD_PD                      0x3UL       /**> Num of odd pins port D */
#define GPIO_PINSEL_WIDTH                    0x4UL       /**> Route config pin select width */
#define GPIO_PORTSEL_WIDTH                   0x2UL       /**> Route config port select width */
#define GPIO_PORT_A_WIDTH                    0xBUL       /**> Port A Width */
#define GPIO_PORT_A_WIDTH_ZERO               0x0UL       /**> Port A Width is Zero */
#define GPIO_PORT_A_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_A_WU                       0x3UL       /**> New Param */
#define GPIO_PORT_A_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_PORT_B_WIDTH                    0x7UL       /**> Port B Width */
#define GPIO_PORT_B_WIDTH_ZERO               0x0UL       /**> Port B Width is Zero */
#define GPIO_PORT_B_WL                       0x7UL       /**> New Param */
#define GPIO_PORT_B_WU                       0x0UL       /**> New Param */
#define GPIO_PORT_B_WU_ZERO                  0x1UL       /**> New Param */
#define GPIO_PORT_C_WIDTH                    0xAUL       /**> Port C Width */
#define GPIO_PORT_C_WIDTH_ZERO               0x0UL       /**> Port C Width is Zero */
#define GPIO_PORT_C_WL                       0x8UL       /**> New Param */
#define GPIO_PORT_C_WU                       0x2UL       /**> New Param */
#define GPIO_PORT_C_WU_ZERO                  0x0UL       /**> New Param */
#define GPIO_PORT_D_WIDTH                    0x6UL       /**> Port D Width */
#define GPIO_PORT_D_WIDTH_ZERO               0x0UL       /**> Port D Width is Zero */
#define GPIO_PORT_D_WL                       0x6UL       /**> New Param */
#define GPIO_PORT_D_WU                       0x0UL       /**> New Param */
#define GPIO_PORT_D_WU_ZERO                  0x1UL       /**> New Param */
#define GPIO_SEGALLOC_WIDTH                  0x14UL      /**> New Param */
#define GPIO_SLEWRATE_WIDTH                  0x3UL       /**> Slew Rate Width Param */
#define LDMA_CH_BITS                         0x5UL       /**> New Param */
#define LDMA_CH_NUM                          0x8UL       /**> New Param */
#define LDMA_FIFO_BITS                       0x5UL       /**> New Param */
#define LDMA_FIFO_DEPTH                      0x10UL      /**> New Param */
#define LDMAXBAR_CH_BITS                     0x5UL       /**> None */
#define LDMAXBAR_CH_NUM                      0x8UL       /**> None */
#define LDMAXBAR_SIGSEL_W                    0x4UL       /**> New Param */
#define LDMAXBAR_SOURCESEL_W                 0x6UL       /**> New Param */
#define TIMER0_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER0_CNTWIDTH                      0x20UL      /**> Counter Width */
#define TIMER0_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER0_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER0_NO_DTI                        0x0UL       /**>  */
#define TIMER1_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER1_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER1_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER1_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER1_NO_DTI                        0x0UL       /**>  */
#define TIMER2_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER2_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER2_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER2_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER2_NO_DTI                        0x0UL       /**>  */
#define TIMER3_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER3_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER3_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER3_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER3_NO_DTI                        0x0UL       /**>  */
#define TIMER4_CC_NUM                        0x3UL       /**> Number of Compare/Capture Channels */
#define TIMER4_CNTWIDTH                      0x10UL      /**> Counter Width */
#define TIMER4_DTI                           0x1UL       /**> Dead-time insertion enabled */
#define TIMER4_DTI_CC_NUM                    0x3UL       /**> Number of DTI Channels */
#define TIMER4_NO_DTI                        0x0UL       /**>  */
#define USART0_AUTOTX_REG                    0x1UL       /**> None */
#define USART0_AUTOTX_REG_B                  0x0UL       /**> None */
#define USART0_AUTOTX_TRIGGER                0x1UL       /**> None */
#define USART0_AUTOTX_TRIGGER_B              0x0UL       /**> New Param */
#define USART0_CLK_PRS                       0x1UL       /**> None */
#define USART0_CLK_PRS_B                     0x0UL       /**> New Param */
#define USART0_FLOW_CONTROL                  0x1UL       /**> None */
#define USART0_FLOW_CONTROL_B                0x0UL       /**> New Param */
#define USART0_I2S                           0x1UL       /**> None */
#define USART0_I2S_B                         0x0UL       /**> New Param */
#define USART0_IRDA_AVAILABLE                0x1UL       /**> None */
#define USART0_IRDA_AVAILABLE_B              0x0UL       /**> New Param */
#define USART0_MVDIS_FUNC                    0x1UL       /**> None */
#define USART0_MVDIS_FUNC_B                  0x0UL       /**> New Param */
#define USART0_RX_PRS                        0x1UL       /**> None */
#define USART0_RX_PRS_B                      0x0UL       /**> New Param */
#define USART0_SC_AVAILABLE                  0x1UL       /**> None */
#define USART0_SC_AVAILABLE_B                0x0UL       /**> New Param */
#define USART0_SYNC_AVAILABLE                0x1UL       /**> None */
#define USART0_SYNC_AVAILABLE_B              0x0UL       /**> New Param */
#define USART0_SYNC_LATE_SAMPLE              0x1UL       /**> None */
#define USART0_SYNC_LATE_SAMPLE_B            0x0UL       /**> New Param */
#define USART0_TIMER                         0x1UL       /**> New Param */
#define USART0_TIMER_B                       0x0UL       /**> New Param */
#define BURTC_CNTWIDTH                       0x20UL      /**> None */
#define BURTC_PRECNT_WIDTH                   0xFUL       /**>  */
#define I2C1_DELAY                           0x7D0UL     /**> Delay cell selection */
#define I2C1_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define SYSCFG_CHIP_FAMILY                   0x38UL      /**> CHIP Family */
#define SYSCFG_DEMODRAM_INST_COUNT           0x1UL       /**>  */
#define SYSCFG_FRCRAM_INST_COUNT             0x1UL       /**>  */
#define SYSCFG_SEQRAM_INST_COUNT             0x2UL       /**> None */
#define SYSCFG_SWINT_NUM                     0x4UL       /**> Software interupts */
#define DCDC_DRVSPEED_WIDTH                  0x2UL       /**> Drive Speed bitfield width */
#define DCDC_IPKVAL_WIDTH                    0x4UL       /**> Peak Current Setting bitfield Width */
#define DCDC_VCMPIBIAS_WIDTH                 0x2UL       /**> VCMP ibias bitfield width */
#define HOSTMAILBOX_NUM_MSGPTRS              0x4UL       /**>  */
#define EUSART1_EM2_CAPABLE                  0x0UL       /**> EM2 Capable instance */
#define EUSART1_NOT_EM2_CAPABLE              0x1UL       /**> Not EM2 Capable instance */
#define EUSART2_EM2_CAPABLE                  0x0UL       /**> EM2 Capable instance */
#define EUSART2_NOT_EM2_CAPABLE              0x1UL       /**> Not EM2 Capable instance */
#define SYSRTC0_GROUP0_ALTIRQDIS             0x1UL       /**> Group 0 Alternate IRQ disable */
#define SYSRTC0_GROUP0_CAPDIS                0x0UL       /**> Group 0 Capture disable */
#define SYSRTC0_GROUP0_CMP1DIS               0x0UL       /**> Group 0 Compare1 disable */
#define SYSRTC0_GROUP0_DIS                   0x0UL       /**> Group 0 Disable */
#define SYSRTC0_GROUP0_ROOTDIS               0x1UL       /**> Group 0 ROOT disable */
#define SYSRTC0_GROUP1_ALTIRQDIS             0x0UL       /**> Group 1 Alternate IRQ disable */
#define SYSRTC0_GROUP1_CAPDIS                0x0UL       /**> Group 1 Capture disable */
#define SYSRTC0_GROUP1_CMP1DIS               0x0UL       /**> Group 1 Compare1 disable */
#define SYSRTC0_GROUP1_DIS                   0x0UL       /**> Group 1 Disable */
#define SYSRTC0_GROUP1_ROOTDIS               0x1UL       /**> Group 1 ROOT disable */
#define SYSRTC0_GROUP2_ALTIRQDIS             0x1UL       /**> Group 2 Alternate IRQ disable */
#define SYSRTC0_GROUP2_CAPDIS                0x1UL       /**> Group 2 Capture disable */
#define SYSRTC0_GROUP2_CMP1DIS               0x1UL       /**> Group 2 Compare1 disable */
#define SYSRTC0_GROUP2_DIS                   0x0UL       /**> Group 2 Disable */
#define SYSRTC0_GROUP2_ROOTDIS               0x0UL       /**> Group 2 ROOT disable */
#define SYSRTC0_GROUP3_ALTIRQDIS             0x1UL       /**> Group 3 Alternate IRQ disable */
#define SYSRTC0_GROUP3_CAPDIS                0x1UL       /**> Group 3 Capture disable */
#define SYSRTC0_GROUP3_CMP1DIS               0x1UL       /**> Group 3 Compare1 disable */
#define SYSRTC0_GROUP3_DIS                   0x1UL       /**> Group 3 Disable */
#define SYSRTC0_GROUP3_ROOTDIS               0x1UL       /**> Group 3 ROOT disable */
#define SYSRTC0_GROUP4_ALTIRQDIS             0x1UL       /**> Group 4 Alternate IRQ disable */
#define SYSRTC0_GROUP4_CAPDIS                0x1UL       /**> Group 4 Capture disable */
#define SYSRTC0_GROUP4_CMP1DIS               0x1UL       /**> Group 4 Compare1 disable */
#define SYSRTC0_GROUP4_DIS                   0x1UL       /**> Group 4 Disable */
#define SYSRTC0_GROUP4_ROOTDIS               0x1UL       /**> Group 4 ROOT disable */
#define SYSRTC0_GROUP5_ALTIRQDIS             0x1UL       /**> Group 5 Alternate IRQ disable */
#define SYSRTC0_GROUP5_CAPDIS                0x1UL       /**> Group 5 Capture disable */
#define SYSRTC0_GROUP5_CMP1DIS               0x1UL       /**> Group 5 Compare1 disable */
#define SYSRTC0_GROUP5_DIS                   0x1UL       /**> Group 5 Disable */
#define SYSRTC0_GROUP5_ROOTDIS               0x1UL       /**> Group 5 ROOT disable */
#define SYSRTC0_GROUP6_ALTIRQDIS             0x1UL       /**> Group 6 Alternate IRQ disable */
#define SYSRTC0_GROUP6_CAPDIS                0x1UL       /**> Group 6 Capture disable */
#define SYSRTC0_GROUP6_CMP1DIS               0x1UL       /**> Group 6 Compare1 disable */
#define SYSRTC0_GROUP6_DIS                   0x1UL       /**> Group 6 Disable */
#define SYSRTC0_GROUP6_ROOTDIS               0x1UL       /**> Group 6 ROOT disable */
#define SYSRTC0_GROUP7_ALTIRQDIS             0x1UL       /**> Group 7 Alternate IRQ disable */
#define SYSRTC0_GROUP7_CAPDIS                0x1UL       /**> Group 7 Capture disable */
#define SYSRTC0_GROUP7_CMP1DIS               0x1UL       /**> Group 7 Compare1 disable */
#define SYSRTC0_GROUP7_DIS                   0x1UL       /**> Group 7 Disable */
#define SYSRTC0_GROUP7_ROOTDIS               0x1UL       /**> Group 7 ROOT disable */
#define SYSRTC0_ROOTDIS                      0x0UL       /**> ROOT disable */
#define LCD_COM_NUM                          0x4UL       /**> None */
#define LCD_NO_ANIM_LOCS                     0x1UL       /**> None */
#define LCD_NO_BANKED_SEG                    0x1UL       /**>  */
#define LCD_NO_DSC                           0x0UL       /**> None */
#define LCD_NO_EXTOSC                        0x0UL       /**> None */
#define LCD_NO_UPPER_SEGMENTS                0x1UL       /**>  */
#define LCD_OCTAPLEX                         0x0UL       /**> None */
#define LCD_SEGASCOM_NUM                     0x4UL       /**> None */
#define LCD_SEG_NUM                          0x14UL      /**> None */
#define LCD_SEL_WIDTH                        0x3UL       /**> None */
#define KEYSCAN_COLNUM                       0x8UL       /**> COLNUM */
#define KEYSCAN_COLWIDTH                     0x3UL       /**> COLWIDTH */
#define KEYSCAN_ROWNUM                       0x6UL       /**> ROWNUM */
#define SMU_NUM_BMPUS                        0x7UL       /**> Number of BMPUs */
#define SMU_NUM_PPU_PERIPHS                  0x39UL      /**> Number of PPU Peripherals */
#define SMU_NUM_PPU_PERIPHS_MOD_32           0x19UL      /**> Number of PPU Peripherals (mod 32) */
#define SMU_NUM_PPU_PERIPHS_SUB_32           0x19UL      /**> Number of PPU peripherals minus 32 */
#define SMU_PERIPHID_BITS                    0x8UL       /**> Bits used for Peripheral ID */
#define LETIMER0_CNT_WIDTH                   0x18UL      /**> Count Width */
#define IADC0_CONFIGNUM                      0x2UL       /**> CONFIG */
#define IADC0_FULLRANGEUNIPOLAR              0x0UL       /**> FULLRANGEUNIPOLAR */
#define IADC0_SCANBYTES                      0x1UL       /**> SCANBYTES */
#define IADC0_ENTRIES                        0x10UL      /**> ENTRIES */
#define ACMP0_DAC_INPUT                      0x1UL       /**> None */
#define ACMP0_EXT_OVR_IF                     0x1UL       /**> None */
#define ACMP1_DAC_INPUT                      0x1UL       /**> None */
#define ACMP1_EXT_OVR_IF                     0x1UL       /**> None */
#define AMUXCP0_AMUXCPNUM                    0x0UL       /**> AMUXCPNUM */
#define VDAC0_ALT_WIDTH                      0x6UL       /**> VOUT_AUX Out Width */
#define VDAC0_CH1_TRIG_LESENSE               0x0UL       /**> CH1 Trig Source = LESENSE */
#define VDAC0_FIFO_DEPTH                     0x4UL       /**> WFIFO Depth */
#define VDAC0_INT_PRESC_WIDTH                0x7UL       /**> Internal Prescaler Width */
#define VDAC0_RESOLUTION                     0xCUL       /**> DAC Resolution */
#define PCNT0_PCNT_WIDTH                     0x10UL      /**> None */
#define LESENSE_CHANNEL_NUM                  0x10UL      /**> None */
#define LESENSE_RIPCNT_WIDTH                 0x10UL      /**> None */
#define LESENSE_STATE_NUM                    0x20UL      /**> None */
#define HFRCOEM23_EM23ONDEMAND               0x1UL       /**> EM23 On Demand */
#define HFRCOEM23_EXCLUDEEM23ONDEMAND        0x0UL       /**> Exclude EM23 On Demand */
#define HFXO0_BUFOUT                         0x1UL       /**> BUFOUT */
#define HFXO0_EXCLUDEBUFOUT                  0x0UL       /**> Exclude BUFOUT */
#define I2C0_DELAY                           0x3E8UL     /**> Delay cell selection */
#define I2C0_DELAY_CHAIN_NUM                 0x2UL       /**> Number of delay chain */
#define WDOG0_PCNUM                          0x2UL       /**> None */
#define WDOG1_PCNUM                          0x2UL       /**> None */
#define EUSART0_EM2_CAPABLE                  0x1UL       /**> EM2 Capable instance */
#define EUSART0_NOT_EM2_CAPABLE              0x0UL       /**> Not EM2 Capable instance */

/* Instance macros for ACMP */
#define ACMP(n)                         (((n) == 0) ? ACMP0   \
                                         : ((n) == 1) ? ACMP1 \
                                         : 0x0UL)
#define ACMP_NUM(ref)                   (((ref) == ACMP0) ? 0   \
                                         : ((ref) == ACMP1) ? 1 \
                                         : -1)
#define ACMP_DAC_INPUT(n)               (((n) == 0) ? ACMP0_DAC_INPUT   \
                                         : ((n) == 1) ? ACMP1_DAC_INPUT \
                                         : 0x0UL)
#define ACMP_EXT_OVR_IF(n)              (((n) == 0) ? ACMP0_EXT_OVR_IF   \
                                         : ((n) == 1) ? ACMP1_EXT_OVR_IF \
                                         : 0x0UL)

